#read_verilog -D ICE40_HX -IUtil -lib -specify +/ice40/cells_sim.v ./Top.v
#hierarchy -check -top Top
#proc

synth_ice40 -run : -top Top -json Top.json
